"""git - система управления версиями кода """

#git_hub - сайт который дает хранилище для кода 

# так же есть gitlab bitbucket

#репозиторий - папка с проектами с которыми можно работать git 


# ssh-keygen - создает ключи




# git config --global user.name "your-name"
# git config --global user.email "your-email"
# Указания своих данных


# git init - превратить папку в репозиторий и создает скрытую папку .git


#  создаете репозиторий на github
# git remote add origin <ссылка на репозиторий> - добавить ссылку на репозиторий в переменную origin



# git add ./filename - добавляет указанные файлы в индекс/ начинает отслеживание файлов 


# git commit -m "название для версии" - создание  версии кода / создать сохр кода


# git push origin имя_ветки - отправить версию кода на github


#  git log - список коммитов
# git log --oneline


# git clone <ссылка на репозиторий> 